Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/travel_and_recreation/vehicle_standards/lighting_of_bicycles_in_ireland.html.txt.tmx
Source language: en
Languages: pl

source: Lighting of bicycles in Ireland
pl: Oświetlenie rowerów w Irlandii

source: All bicycles used on public roads are required to comply with the Road Traffic (Lighting of Vehicles) Regulations 1963 as amended
pl: przepisami Rozporządzenia o ruchu drogowym (oświetlenie pojazdów) z 1963 roku ze zmianami

source: This law sets down the type of reflectors and lamps that your bicycle must be fitted with and when you must use your bicycle lamps
pl: Prawo to określa rodzaje świateł odblaskowych i lamp, które twój rower musi posiadać, oraz kiedy musisz używać lamp rowerowych

source: Every year in Ireland, many cyclists are hurt, seriously injured or killed as a result of improper lighting on their bicycles
pl: Każdego roku w Irlandii w wyniku nieprawidłowego oświetlenia rowerów wielu rowerzystów ulega wypadkom, ciężkim uszkodzeniom ciała lub ponosi śmierć

source: Rights to demand name and address of cyclists
pl: Prawo do zażądania podania imienia i nazwiska, a także adredu rowerzysty

source: Under Section 108 of the Road Traffic Act 1961 as amended, a member of An Garda Síochána (Irish police force) may demand your name, address and date of birth if they suspect you have committed any crime or offence
pl: Zgodnie z Artykułem 108 Ustawy o ruchu drogowym z 1961 roku, ze zmianami, funkcjonariusz An Garda Síochána (Irlandzkich sił policji) może zażądać od ciebie podania twojego imienia i nazwiska, adresu oraz daty urodzenia, jeśli podejrzewa że popełniłeś przestępstwo lub wykroczenie

source: They may also demand your name, address and date of birth if they suspect you have been involved in a collision or caused injury to property or someone else
pl: Mogą oni także zażądać od ciebie podania twojego imienia i nazwiska, adresu oraz daty urodzenia, jeśli podejrzewają, że byłeś uczestnikiem kolizji lub spowodowałeś uszkodzenia mienia lub obrażenia innej osoby

source: If you fail to give your name, address or date of birth, or give a false name, address or date of birth, the Garda may retain your bicycle until they are satisfied as to your identity
pl: Jeśli nie podasz swojego imienia i nazwiska, adresu lub daty urodzenia, lub podasz nieprawdziwe imię i nazwisko, adres lub datę urodzenia, funkcjonariusz Garda ma prawo zatrzymać twój rower do chwili, gdy będzie przekonany co do twojej tożsamości

source: All bicycles used on public roads in Ireland must at all times display a rear reflector
pl: Jest to czerwone światło odblaskowe roweru, dobrze widoczne z odległości ok

source: A rear reflector means a red reflector that can be plainly seen for a distance of 99 meters (325 feet) to the rear when the headlights of a vehicle shine directly on it
pl: 100 m (325 stóp), w momencie gdy światła reflektorów pojazdu jadącego za nim padają bezpośrednio na nie

source: The only exception to this rule is on a child's bicycle where that bicycle is used during the daytime
pl: Jedynym wyjątkiem od tej reguły jest rower dziecięcy, pod warunkiem że używany jest on jedynie w ciągu dnia

source: During "lighting-up time", that is, the period beginning half an hour after sunset and ending half an hour before sunrise on the following morning, all cyclists are required to have fitted (and make use of) the following lighting on their bicycles:
pl: W czasie obowiązkowego włączenia świateł, tzn. w okresie rozpoczynającym się pół godziny po zachodzie słońca i kończącym się pół godziny przed wschodem słońca następnego dnia, każdy rower musi być wyposażony w następujące elementy oświetleniowe (które muszą być włączone):

source: A front lamp means a lamp that is fitted to a non-mechanically propelled vehicle showing to the front a white or yellow light that is visible for a reasonable distance
pl: Lampa przednia to lampa przymocowana do pojazdu nieposiadającego napędu mechanicznego, świecąca z przodu światłem białym lub żółtym, widocznym na odpowiednią odległość

source: A rear lamp is a lamp that is fitted to the rear of your bicycle and when it is lit, showing a red light that is visible for a reasonable distance
pl: Lampa tylna to lampa przymocowana z tyłu roweru, która świecąc emituje czerwone światło widoczne na odpowiednią odległość

source: Under SI 487 of 2009, since 14 December 2009 it is legal to use flashing front and rear lamps
pl: Zgodnie SI 487 z 2009, od dnia 14 grudnia 2009 roku jest prawnym do korzystania migający przednie i tylne światła

source: Lamps do not need to be lit when stopped in traffic or when a person wheels the bicycle on foot as near as is possible to the left-hand edge of the road
pl: Lampy nie muszą być włączone w czasie, gdy rower nie uczestniczy w ruchu drogowym oraz gdy jest pchany przez pieszego trzymającego się jak najbliżej lewej krawędzi drogi

source: Failure to use proper lighting on a bicycle is an offence
pl: Brak odpowiedniego oświetlenia roweru stanowi wykroczenie

source: If you are stopped by a member of the Gardai, the Garda may take your name and address, details about your bicycle and the time and date of the offence
pl: Funkcjonariusz policji, który zatrzymał rowerzystę może zanotować jego nazwisko i adres, dane roweru oraz datę i godzinę popełnienia wykroczenia

source: Most bicycles sold in shops today are already fitted with appropriate reflectors as standard
pl: Zatrzymanie takie może się zakończyć pouczeniem lub wezwaniem do stawienia się w sądzie

source: If you wish to use your bicycle on a public road in Ireland but are unsure about whether your bicycle conforms to the law, you should contact your nearest Garda station for further advice and information
pl: Jeśli pragniesz użytkować swój rower na drogach publicznych Irlandii, ale nie jesteś pewien czy rower spełnia wymagania prawne, wtedy powinieneś skontaktować się z najbliższym posterunkiem Garda w celu uzyskania dalszych porad i informacji
